Autodesk.Revit.UI.Macros.UIMacroManager.RemoveModule(Autodesk.Revit.DB.Macros.MacroModule)
Removes a MacroModule.
module:
The module will be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.AddModule(Autodesk.Revit.DB.Macros.ModuleSettings,Autodesk.Revit.DB.Macros.MacroEnvironment,Autodesk.Revit.DB.Macros.IModuleMaker)
Adds a MacroModule to the application.
moduleSettings:
The module settings.
environment:
The module environment.
maker:
The interface to create module project.
Returns:
The new module.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the module name is duplicated with the existing one,
or the name is too long, or the name contains invalid identifier(s),
such as include "#", "%", ... and key words in C#.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.UI.Macros.UIMacroManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.MacroManager
The DB macro manager.
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager.GetMacroManager(Autodesk.Revit.UI.UIApplication)
Gets the UI Macro manager from the UI application.
application:
The UI application.
Returns:
The new UI Macro manager object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.UI.Macros.UIMacroManager
The UI macro manager to support Macro operations.
Since:
2014